#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Адрес = НРег(СокрЛП(АдресСайта));
	Если ЗначениеЗаполнено(Адрес)
		И Не СтрНачинаетсяС(Адрес, "http://") И Не СтрНачинаетсяС(Адрес, "https://") Тогда
		ОбщегоНазначения.СообщитьПользователю(
			"Адрес сайта должен начинаться с http:// или https://", ЭтотОбъект, "АдресСайта", , Отказ);
	КонецЕсли;
	
	Если Используется И ГруппыНоменклатуры.Количество() = 0 Тогда
		ОбщегоНазначения.СообщитьПользователю(
			"Укажите хотя бы одну группу номенклатуры для сайта", ЭтотОбъект, "ГруппыНоменклатуры", , Отказ);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
